{
  "backend/main.mo": "Empty Motoko actor serving as the ICP backend placeholder with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (stores, routing, screens) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON summaries of three frontend files: App.tsx (routing), ProfileScreen.tsx (user profile UI), and PrivacyPolicyScreen.tsx (privacy policy display).",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens and border radius.",
  "frontend/index.html": "HTML entry point for the Luminique app, loading the Poppins font from Google Fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component that sets up TanStack Router with 8 routes (splash, onboarding, home, routine, shop, community, profile, privacy) and a root layout with a global toast container.",
  "frontend/src/components/Confetti.tsx": "Animated confetti component that spawns 28 colored falling particles when triggered and clears them after 2.5 seconds, calling an optional onComplete callback.",
  "frontend/src/components/FlowerEngine.tsx": "SVG-based flower growth visualization component that renders one of three states (seed, bud, bloom) with corresponding animations and descriptive labels.",
  "frontend/src/components/GlowPointsBadge.tsx": "Badge component displaying the user's current glow points with a flame icon, and shows a floating +N animation whenever points increase.",
  "frontend/src/components/layout/BottomTabBar.tsx": "Renders a fixed bottom navigation bar with five tabs (Home, Routine, Shop, Community, Profile) using TanStack Router for navigation and active state highlighting.",
  "frontend/src/components/Logo.tsx": "Reusable Luminique brand logo component rendering an SVG lotus icon with gradient petals and an optional text wordmark, configurable by size.",
  "frontend/src/components/Toast.tsx": "Toast notification system with individual auto-dismissing toast items (3s timeout, slide animations) and a fixed-position container that stacks multiple toasts.",
  "frontend/src/data/mockPosts.ts": "Exports an array of five mock community Post objects with user info, streaks, content, likes, and avatar styling for use in the community feed.",
  "frontend/src/data/products.ts": "Exports an array of skincare Product objects (cleansers, serums, moisturizers, sunscreens) with pricing, ratings, ingredients, reviews, and display metadata for the shop.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/hooks/useToast.ts": "Custom hook that manages a list of toast notifications, exposing showToast and dismissToast callbacks with auto-incrementing IDs.",
  "frontend/src/index.css": "Global stylesheet defining Luminique brand CSS variables, Tailwind base layers, mobile container layout, glassmorphism utilities, scrollbar hiding, and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/CommunityScreen.tsx": "Community feed screen displaying user posts with like/comment interactions, a leaderboard, trending products, and a post composer, using community, user, and shop stores.",
  "frontend/src/screens/HomeScreen.tsx": "Main home screen displaying a personalized greeting, skin-type tips carousel, morning/evening routine completion buttons, flower animation, GlowPoints badge, streak tracker, and a 7-day history heatmap.",
  "frontend/src/screens/OnboardingScreen.tsx": "Multi-step onboarding flow (8 steps) collecting user name, email, gender, age range, skin type, skin concerns, and routine preference, then saving the profile and navigating to the home screen.",
  "frontend/src/screens/PrivacyPolicyScreen.tsx": "Static privacy policy screen that renders categorized sections (data collection, usage, storage, GDPR rights, cookies, children's privacy, policy changes, and contact info) with a back-navigation header.",
  "frontend/src/screens/ProfileScreen.tsx": "User profile screen showing tier/GlowPoints progress, achievement badges, 30-day routine completion rates, notification/analytics toggles, and a data-reset confirmation flow.",
  "frontend/src/screens/RoutineScreen.tsx": "Daily routine tracking screen with step-by-step morning and evening checklists, a monthly calendar heatmap, a 7-day bar chart, streak stats, and confetti/chime rewards on routine completion.",
  "frontend/src/screens/ShopScreen.tsx": "Main shop screen displaying skincare products in a filterable grid with category tabs, wishlist toggling, add-to-cart, and a product detail modal, backed by shopStore and userStore.",
  "frontend/src/screens/SplashScreen.tsx": "Animated splash/loading screen that waits 2.5 seconds then navigates to either the home or onboarding route based on whether the user has completed onboarding.",
  "frontend/src/stores/communityStore.ts": "Zustand persisted store managing community posts and a leaderboard, with a likePost action that toggles like state and adjusts the like count.",
  "frontend/src/stores/routineStore.ts": "Zustand persisted store tracking daily morning/evening skincare routine steps, completion history, and streak calculation with day-reset logic.",
  "frontend/src/stores/shopStore.ts": "Zustand persisted store managing the product catalog, shopping cart (add/remove/update quantity), wishlist toggling, and a cart-bounce animation flag.",
  "frontend/src/stores/userStore.ts": "Zustand persisted store holding user profile, skin preferences, glow points, streak, tier (calculated from points), and onboarding/settings state with corresponding actions.",
  "frontend/src/utils/audioChime.ts": "Plays a pleasant three-note ascending chime using the Web Audio API, lazily initializing a shared AudioContext and silently failing if unavailable.",
  "frontend/src/utils/gamification.ts": "Utility functions for the gamification system: tier calculation, next-tier progress, points per action, and achievement unlocking based on streak/points/purchase state.",
  "frontend/src/utils/getFlowerState.ts": "Returns a flower growth state ('seed', 'bud', 'bloom', or 'withered') based on the user's current and previous streak values.",
  "frontend/src/utils/getRecommendations.ts": "Filters products matching the user's skin type or concerns, sorts by rating descending, and returns the top 6 as personalized recommendations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Luminique frontend, defining dark mode, content paths, custom fonts (Poppins), oklch-based color tokens, border radii, box shadows, and plugins (typography, container-queries, animate).",
  "project_state.json": "Comprehensive project state document describing Luminique's architecture, existing features, known issues, and requirements — serving as the source of truth for the gamified skincare PWA built with React 18, Zustand, Tailwind, and Framer Motion."
}